# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()
"""
fruits = ["яблоко", "банан", "киви", "арбуз"]
n = 1

for i in fruits:
    print(n, '.', '{:>6}'.format(i))
    n += 1
"""

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

"""
a =['q', 'w', 'e', 'r', 't']
b =['a', 's', 'd', 'r', 't']

i = 0

while i < len(a):
    while i < len(b):
        if b[i] == a[i]:
            a.pop(i)
        i+=1
print(a)
"""
# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

"""
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
i=0
b = []

while i<len(a):
    c = a[i]%2
    if c == 0:
        res = a[i]/4
    else:
        res = a[i]*2
    b.insert(i, res)
    i+=1
    
print(b)
"""