# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

# fruits = ["яблоко", "банан", "киви", "арбуз"]
# n = 1
#
# for i in fruits:
#     print(str(n) + '.' + '{:>7}'.format(i))
#     n += 1


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

# a =['q', 'w', 'e', 'a']
# b =['a', 's', 'd', 'r', 'q']
#
# for i in a:
#     if i in b:
#         a.remove(i)
# print(a)

# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

# a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# i=0
# b = []
#
# for i in a:
#     res = i%2
#     if res == 0:
#         res = i/4
#     else:
#         res = i*2
#     b.insert(i, res)
#
# print(b)
